# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

# Первый способ

# a = int(input("Введите любое трехзначное число:"))
# print("Сумма цифр равна:", (a // 100) + (a % 100 // 10) + (a % 10))

# Второй способ

# num = input("Введите любое трехзначное число:")
# a = int(num[0])
# b = int(num[1]) 
# c = int(num[2])
# print("Сумма цифр равна:", a + b + c)

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# S = int(input("Введите количество сделанных журавликов:"))
# if (S % 6 == 0):
#     print("Петя сделал", S // 6, "журавликов")
#     print("Катя сделала", S // 6 * 4 , "журавликов")
#     print("Сережа сделал", S // 6, "журавликов")
# else:
#     print("Количество журавликов введено некорретно")

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно,
# вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

# num = input("Введите шестизначный номер билета:")
# summa_left = int(num[0]) + int(num[1]) + int(num[2])
# summa_rigth = int(num[3]) + int(num[4]) + int(num[5])
# if (summa_left == summa_rigth):
#     print("Ваш билет счастливый, удача на вашей стороне")
# else:
#     print("Ваш билет не счастливый, испытайте удачу еще раз")

# Задача 8: Требуется определить, можно ли от шоколадки 
# размером n × m долек отломить k долек, если разрешается 
# сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

# k = int(input("Введите необходимое количество долек: "))
# n = int(input("Введите длину шоколадки в дольках: "))
# m = int(input("Введите ширину шоколадки в дольках: "))
# if (k == n or k == m):
#     print("Поздравляем", k, "долек у вас в руках")
# else:
#     print("Увы, не получилось")